#### Terraform Plan Output
   ```
   data.terraform_remote_state.fabric: Reading...
data.terraform_remote_state.fabric: Read complete after 1s
module.vpn_routing.apstra_datacenter_routing_policy.vpn["Vendor_C"]: Refreshing state... [id=3IY6MnbHODyesIidJA8]
module.vpn_routing.apstra_datacenter_routing_policy.vpn["Vendor_A"]: Refreshing state... [id=qbuQtbkk6v_IIzTfsV4]
module.vpn_routing.apstra_datacenter_routing_policy.vpn["Vendor_B"]: Refreshing state... [id=CM-2VzyoIrTCxS1k4mI]
module.vpn_routing.apstra_datacenter_connectivity_template.vpn: Refreshing state... [id=8b255ae8-3aaa-11ee-ba31-617073747261]
null_resource.force_redeploy: Refreshing state... [id=1888671911128261135]
apstra_blueprint_deployment.dc_1: Refreshing state...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # apstra_blueprint_deployment.dc_1 will be created
  + resource "apstra_blueprint_deployment" "dc_1" {
      + blueprint_id            = "1e569eb0-5be1-46ac-a60c-1f7a0d924f7f"
      + comment                 = "$COMMENT Terraform {{.TerraformVersion}}, provider {{.ProviderVersion}}"
      + has_uncommitted_changes = (known after apply)
      + revision_active         = (known after apply)
      + revision_staged         = (known after apply)
    }

  # null_resource.force_redeploy must be replaced
-/+ resource "null_resource" "force_redeploy" {
      ~ id       = "1888671911128261135" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "fabric_staging_revision" = "45" -> (known after apply)
        }
    }

  # module.vpn_routing.data.apstra_blueprint_deployment.dc_1 will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "apstra_blueprint_deployment" "dc_1" {
      + blueprint_id            = "1e569eb0-5be1-46ac-a60c-1f7a0d924f7f"
      + comment                 = (known after apply)
      + has_uncommitted_changes = (known after apply)
      + revision_active         = (known after apply)
      + revision_staged         = (known after apply)
    }

  # module.vpn_routing.data.apstra_datacenter_ct_bgp_peering_ip_endpoint.vpn will be read during apply
  # (config refers to values not yet known)
 <= data "apstra_datacenter_ct_bgp_peering_ip_endpoint" "vpn" {
      + child_primitives = [
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
        ]
      + ipv4_address     = "192.168.5.5"
      + primitive        = (known after apply)
    }

  # module.vpn_routing.data.apstra_datacenter_ct_ip_link.vpn will be read during apply
  # (config refers to values not yet known)
 <= data "apstra_datacenter_ct_ip_link" "vpn" {
      + child_primitives     = [
          + (known after apply),
        ]
      + ipv4_addressing_type = "numbered"
      + primitive            = (known after apply)
      + routing_zone_id      = "89kVMG1nFhZIuv83ZgA"
    }

  # module.vpn_routing.data.apstra_datacenter_ct_routing_policy.vpn["Vendor_A"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "apstra_datacenter_ct_routing_policy" "vpn" {
      + primitive         = (known after apply)
      + routing_policy_id = "qbuQtbkk6v_IIzTfsV4"
    }

  # module.vpn_routing.data.apstra_datacenter_ct_routing_policy.vpn["Vendor_B"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "apstra_datacenter_ct_routing_policy" "vpn" {
      + primitive         = (known after apply)
      + routing_policy_id = "CM-2VzyoIrTCxS1k4mI"
    }

  # module.vpn_routing.data.apstra_datacenter_ct_routing_policy.vpn["Vendor_C"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "apstra_datacenter_ct_routing_policy" "vpn" {
      + primitive         = (known after apply)
      + routing_policy_id = "3IY6MnbHODyesIidJA8"
    }

  # module.vpn_routing.data.apstra_datacenter_ct_routing_policy.vpn["Vendor_D"] will be read during apply
  # (config refers to values not yet known)
 <= data "apstra_datacenter_ct_routing_policy" "vpn" {
      + primitive         = (known after apply)
      + routing_policy_id = (known after apply)
    }

  # module.vpn_routing.apstra_datacenter_connectivity_template.vpn will be created
  + resource "apstra_datacenter_connectivity_template" "vpn" {
      + blueprint_id = "1e569eb0-5be1-46ac-a60c-1f7a0d924f7f"
      + description  = "includes routing policies for [Vendor_A, Vendor_B, Vendor_C, Vendor_D]"
      + id           = (known after apply)
      + name         = "IP+BGP handoff to VPN block"
      + primitives   = [
          + (known after apply),
        ]
      + tags         = [
          + "terraform",
          + "test",
        ]
    }

  # module.vpn_routing.apstra_datacenter_routing_policy.vpn["Vendor_D"] will be created
  + resource "apstra_datacenter_routing_policy" "vpn" {
      + blueprint_id        = "1e569eb0-5be1-46ac-a60c-1f7a0d924f7f"
      + description         = "Vendor_D: Import count: 1 Export count: 3"
      + expect_default_ipv4 = true
      + expect_default_ipv6 = true
      + export_policy       = {
          + export_l2_edge_subnets        = false
          + export_l3_edge_server_links   = false
          + export_loopbacks              = false
          + export_spine_leaf_links       = false
          + export_spine_superspine_links = false
          + export_static_routes          = false
        }
      + extra_exports       = [
          + {
              + action = "permit"
              + prefix = "10.5.0.0/24"
            },
          + {
              + action = "permit"
              + prefix = "10.5.7.0/24"
            },
          + {
              + action = "permit"
              + prefix = "10.5.32.0/22"
            },
        ]
      + extra_imports       = [
          + {
              + action = "permit"
              + prefix = "172.19.0.0/24"
            },
        ]
      + id                  = (known after apply)
      + import_policy       = "extra_only"
      + name                = "Vendor_D"
    }

Plan: 4 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

   ```
   